#+title: Spelling
This file implements some logic for creating common labels for things like different kinds of food (e.g., "Beans"=="beans") or units of measurement.
** Tests
Now apply the code to the examples.
#+begin_src python :noweb no-export :results output :var examples=examples
<<regularize_string>>
for line in examples:
    inout = line.split(' -> ')
    myin = inout[0][1:-1]
    myout = inout[1][1:-1]
    reg = regularize_string(myin)
    if reg != myout:
        print(f"{myin} :: {regularize_string(myin)} -> {myout}")


#+end_src

#+results:
#+begin_example
foo or bar :: Foo or Bar -> Foo/Bar
slash/dot  :: Slash /dot -> Slash/Dot
Chambiko - Soured Milk :: Chambiko(soured milk) -> Chambiko (soured milk)
Soft Drinks (Cola, Fanta, Sprite, etc.) :: Soft Drinks(etc.) -> Soft Drinks (cola, etc.)
Soft Drinks (Cola, Fa :: Soft Drinks(cola, etc.) -> Soft Drinks (cola, etc.)
Small Animals - Rabbit, Mice :: Small Animals(rabbit, etc.) -> Small Animals (rabbit, mice)
Chicken/pieces :: Chicken /pieces -> Chicken/Pieces
Chicken/Duck :: Chicken /duck -> Chicken/Duck
Other Poultry-Guinea Fowl, :: Other Poultry(guinea fowl, etc.) -> Other Poultry (guinea fowl
Foo/ bar :: Foo /bar -> Foo/Bar
Foo-bar :: Foo(bar) -> Foo (bar)
Foo - bar :: Foo(bar) -> Foo (bar)
#+end_example

